htmlized-src/emacs/emacs-vc.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>emacs-vc.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">emacs &#36827;&#34892;&#29256;&#26412;&#25511;&#21046;(Version Control)</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#23396;&#23792;&#29420;&#31168;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2011-07-05 &#20108;</span>
<span class="org-meta-line">#+DESCRIPTION:emacs &#36827;&#34892;&#29256;&#26412;&#25511;&#21046;(Version Control)
#+KEYWORDS: vc emacs svn psvn git scm 
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+FILETAGS: @Emacs @Ediff @Git
</span>&#20160;&#20040;&#26159;&#29256;&#26412;&#25511;&#21046;&#23601;&#19981;&#22810;&#35828;&#20102;&#65292;&#24120;&#35265;&#30340;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#26377;svn git cvs &#31561;&#12290;&#25105;&#21482;&#29992;&#36807;svn&#21450;
git ,&#24120;&#29992;git &#65292;&#25152;&#20197;&#20197;git &#20197;&#20363;&#36827;&#34892;&#35828;&#26126;&#12290;&#21478;&#22806;&#65292;Emacs &#20013;&#26377;&#20010;vc.el ,vc&#26159;version
control &#30340;&#32553;&#20889;&#65292;&#23427;&#19981;&#26159;svn git &#20043;&#31867;&#30340;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#12290;&#24590;&#20040;&#20171;&#32461;&#23427;&#21602;&#65292;&#23427;&#26159;&#19968;&#20010;&#25509;&#21475;
&#21543;&#65292;&#19981;&#35770;&#20320;&#29992;&#30340;&#26159;svn &#36824;&#26159;git &#37117;&#21487;&#20197;&#29992;&#23427;&#36827;&#34892;&#29256;&#26412;&#25511;&#21046;&#12290;&#20294;&#27605;&#31455;&#27599;&#20010;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#37117;
&#26377;&#23427;&#29305;&#26377;&#30340;&#29305;&#24615;&#65292;&#25152;&#20197;vc&#23545;svn git &#31561;&#19987;&#26377;&#30340;&#21151;&#33021;&#24182;&#27809;&#26377;&#20570;&#21040;&#32479;&#19968;&#65292;&#19981;&#20250;&#24120;&#29992;&#30340;
update commit ,checkout &#31561;&#26368;&#22522;&#26412;&#30340;&#25805;&#20316;&#23427;&#37117;&#23454;&#29616;&#20102;&#12290;&#25152;&#20197;vc&#30340;&#23384;&#22312;&#36824;&#26159;&#24456;&#26377;&#24517;&#35201;&#30340;&#12290;

<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">;; Version Control Merge Diff Ediff
(eval-after-load 'vc-svn '(progn (require 'psvn)))

;;version control :VC
;;&#22312;&#36827;&#34892;`C-xvv' `C-xvi'&#31561;&#25805;&#20316;&#26102;&#19981;&#24517;&#36827;&#34892;&#30830;&#35748;,
;;&#33258;&#21160;&#20445;&#23384;&#24403;&#21069;buffer&#21518;&#36827;&#34892;&#25805;&#20316; &#38500;&#38750;&#36827;&#34892;&#19968;&#20010;&#21361;&#38505;&#30340;&#25805;&#20316;,&#22914;&#22238;&#28378;
(setq-default vc-suppress-confirm t)
;;VC &#30340;&#24456;&#22810;&#25805;&#20316;&#26159;&#35843;&#29992;&#22806;&#37096;&#21629;&#20196;,&#23427;&#36873;&#39033;&#20250;&#25552;&#31034;&#21629;&#20196;&#30340;&#30456;&#24212;&#20449;&#24687;,&#22914;&#36816;&#34892;&#20102;&#21738;&#20010;&#21629;&#20196;
(setq-default vc-command-messages t )
;;,&#40664;&#35748;`C-cC-c'&#26159;&#27492;&#25805;&#20316;,&#20294;&#24635;&#25163;&#35823;,&#32534;&#36753;&#23436;&#25552;&#20132;&#26085;&#24535;&#30340;&#20869;&#23481;,&#36827;&#34892;&#25552;&#20132;&#25805;&#20316;
(eval-after-load 'log-edit
  '(progn (define-key vc-log-mode-map "\C-x\C-s" 'log-edit-done)))

;;C-xv= &#20351;&#29992;ediff
;; ediff C-xv= ,C-xvC-=  diff

(eval-after-load 'vc-hooks
  '(progn
     (require 'ediff)
     (defun ediff-current-buffer-revision ()
       "Run Ediff to diff current buffer's file against VC depot.
Uses `vc.el' or `rcs.el' depending on `ediff-version-control-package'."
       (interactive)
       (let ((file (or (buffer-file-name)
                       (error "Current buffer is not visiting a file"))))
         (if (and (buffer-modified-p)
                  (y-or-n-p (message "Buffer %s is modified. Save buffer? "
                                     (buffer-name))))
             (save-buffer (current-buffer)))
         (ediff-load-version-control)
         (funcall
          (intern (format "ediff-%S-internal" ediff-version-control-package))
          "" "" nil)))
     (define-key vc-prefix-map (kbd "C-=") 'ediff-current-buffer-revision)
;;     (define-key vc-prefix-map "=" 'ediff-current-buffer-revision);;C-xv=
;;     (define-key vc-prefix-map (kbd "C-=") 'vc-diff);;&#21407;&#26469;&#30340;C-xv=,&#29616;&#22312;&#32465;&#23450;&#21040;C-xvC-=
     ))

;;
;; &#22312;  *vc-change-log* &#20013;&#40664;&#35748;=&#32465;&#23450;&#22312; log-view-diff
;; &#20351;&#29992;diff &#36827;&#34892;&#27604;&#36739; &#65292;&#27492;&#22788;&#40664;&#35748;&#25913;&#20026;&#20351;&#29992;ediff &#36827;&#34892;&#27604;&#36739;&#65292;
;; = ediff ,and C-= diff ,in *vc-change-log*

(eval-after-load 'log-view
  '(progn
     (require 'ediff-vers)
     (defun log-view-ediff (beg end)
       "the ediff version of `log-view-diff'"
       (interactive
        (list (if mark-active (region-beginning) (point))
              (if mark-active (region-end) (point))))
       (let ((fr (log-view-current-tag beg))
             (to (log-view-current-tag end)))
         (when (string-equal fr to)
           (save-excursion
             (goto-char end)
             (log-view-msg-next)
             (setq to (log-view-current-tag))))
         (ediff-vc-internal to fr)))
      (define-key log-view-mode-map (kbd "C-=") 'log-view-ediff) ;;&#20351;&#29992;ediff &#36827;&#34892;&#27604;&#36739;
     ;; (define-key log-view-mode-map "=" 'log-view-ediff) ;;&#20351;&#29992;ediff &#36827;&#34892;&#27604;&#36739;
     ;; (define-key log-view-mode-map (kbd "C-=") 'log-view-diff) ;;&#21407;&#26469;&#30340;`=' ,&#29616;&#22312;&#32465;&#23450;&#20026;`C-='
     )
  )


;;&#22312;&#20351;&#29992;diff&#27604;&#36739;&#20004;&#20010;&#25991;&#20214;&#26102;&#65292;&#35843;&#29992;&#27492;&#20989;&#25968;&#65292;&#20250;
;;&#36716;&#25442;&#20026;&#20351;&#29992;ediff &#36827;&#34892;&#27604;&#36739;
;;&#36825;&#20010;&#22909;&#20687;&#20165;&#23545;&#26222;&#36890;&#25991;&#20214;&#30340;&#27604;&#36739;&#26377;&#29992;&#65292;&#26377;&#29256;&#26412;&#25511;&#21046;&#30340;&#25991;&#20214;&#26080;&#29992;&#65292;&#22240;&#20026;&#23427;&#20204;&#20855;&#26377;&#21516;&#26679;&#30340;&#25991;&#20214;&#21517;&#65292;
;;&#36825;&#20010;&#20989;&#25968;&#27809;&#27861;&#21306;&#20998;&#23427;&#20204;
;; diff2ediff function

(eval-after-load 'diff-mode
  '(progn
     (defun diff-2-ediff ()
       "invoke ediff on the context of 2 files in diff-mode"
       (interactive)
       ;; A
       (destructuring-bind (buf-A line-offset pos old new &amp;optional switched)
           (diff-find-source-location 't nil)
         ;; B
         (destructuring-bind (buf-B line-offset pos old new &amp;optional switched)
             (diff-find-source-location nil nil)
           (ediff-buffers buf-A buf-B))))
     (define-key diff-mode-map (kbd "C-=") 'diff-2-ediff)))


;; C-x v v     vc-next-action -- perform the next logical control operation on file &#20250;&#26681;&#25454;&#24403;&#21069;&#25991;&#20214;&#29366;&#24577;&#20915;&#23450;&#35813;&#20570;&#20160;&#20040;
;; 1.&#22914;&#26524;&#24403;&#21069;&#30340;&#25991;&#20214;(work file)&#19981;&#22312;&#20219;&#20309;&#19968;&#20010;version control &#31649;&#29702;&#19979;,&#21017;&#35810;&#38382;&#20320;&#21019;&#24314;&#20160;&#20040;&#26679;&#30340;&#20179;&#24211;,&#22914;svn git&#31561;.
;; 2.&#22914;&#26524;&#22312;&#31649;&#29702;&#19979;,&#21017;register the file. &#21363;git add filename.
;; 3.&#22914;&#26524;work file &#19982;&#24211;&#20013;&#30340;&#25991;&#20214;&#19968;&#26679;,do nothing.
;; 4.&#33509;&#19981;&#19968;&#26679;,&#21017;&#36827;&#34892;merge (checkout &#25110;update) &#25805;&#20316;. &#21363;&#26356;&#26032;(&#22909;&#20687;&#24182;&#19981;&#26356;&#26032;,&#26356;&#26032;&#38656;&#35201;`C-xvu')
;; 5.&#22914;&#26524;&#20320;&#23545;work file &#36827;&#34892;&#30340;&#20462;&#25913;&#21017;&#36827;&#34892;checkin(&#21363;commit)&#25805;&#20316;,&#23427;&#20250;&#25171;&#24320;&#19968;&#20010;*VC-LOG*buffer&#35753;&#20320;&#36755;&#20837;&#26085;&#24535;,&#20851;&#20110;*VC-LOG* &#35265;&#19979;&#38754;&#30340;&#27880;&#37322;
;; 6.&#22914;&#26524;&#26377;&#20914;&#31361;&#21017;&#20808;merge &#26368;&#26032;&#30340;&#25991;&#20214;&#21040;work file,&#27492;&#26102;work file &#22788;&#20110;&#20914;&#31361;&#29366;&#24577;,&#38656;&#35201;&#35299;&#20915;&#20914;&#31361;,&#32487;&#32493;`C-xvv'&#21518;&#35828;&#26126;&#20914;&#31361;&#24050;&#35299;&#20915;&#27492;&#21518;&#20877;`c-xvv'&#21017;&#25552;&#20132;
;;`C-uC-xvv' &#21487;&#20197;&#36873;&#25321;&#36827;&#20837;&#21738;&#20010;&#20998;&#25903;,reversion,

;; C-x v i     vc-register -- add a new file to version control  ;;&#30456;&#24403;&#20110;git add .&#23558;&#25991;&#20214;&#21152;&#20837;&#21040;&#29256;&#26412;&#31649;&#29702;&#24403;&#20013;

;; C-x v ~     vc-version-other-window -- look at other revisions
;;             &#26597;&#30475;&#27492;&#25991;&#20214;&#20197;&#21069;&#30340;&#29256;&#26412;&#23545;&#24212;&#30340;&#20869;&#23481;,&#38656;&#35201;&#36755;&#20837;&#29256;&#26412;&#21495;,git &#25805;&#20316;&#19981;&#22826;&#26041;&#20415;,&#22240;&#20026;&#29256;&#26412;&#21495;&#19981;&#26159;&#36882;&#22686;&#30340;&#25968;&#23383;,&#32780;&#26159;SHA1&#20540;
;; C-x v =     vc-diff -- diff with other revisions
;;             &#23545;&#26410;&#25552;&#20132;&#30340;&#25991;&#20214;&#19982;&#26368;&#26032;&#30340;&#29256;&#26412;&#23545;&#24212;&#30340;&#25991;&#20214;&#36827;&#34892;diff&#25805;&#20316;,C-u&#21487;&#20197;&#36873;&#25321;&#29992;&#21738;&#20004;&#20010;&#29256;&#26412;,&#19981;&#20165;&#21487;&#20197;&#21333;&#25991;&#20214;diff,
;;             &#21487;&#20197;&#26159;fileset,&#22914;&#20309;&#23545;&#22810;&#25991;&#20214;&#36827;&#34892;&#25805;&#20316;&#30475;vc-dir mode `C-xvd' &#31867;&#20284;&#20110;dired, ibuffer.
;; C-x v D     &#21516;`C-xv=' ,&#19981;&#36807;&#26159;&#23545;&#25152;&#26377;&#30340;&#25991;&#20214;&#36827;&#34892;&#19982;&#26368;&#26032;&#30340;&#29256;&#26412;&#36827;&#34892;diff&#25805;&#20316;(`C-xv='&#38656;&#35201;&#36873;&#25321;&#25805;&#20316;&#21738;&#20123;&#25991;&#20214;),&#21363;&#26174;&#31034;&#26368;&#36817;&#36827;&#34892;&#20102;&#21738;&#20123;&#26410;&#25552;&#20132;&#30340;&#20462;&#25913;
;; C-x v u     vc-revert-buffer -- undo checkout  &#25918;&#24323;&#23545;&#25991;&#20214;&#30340;&#20462;&#25913;,&#21363;&#37325;&#26032;update &#19968;&#19979;.
;; &#26597;&#30475;&#26085;&#24535; `*vc-change-log*' buffer
;; C-x v l     vc-print-log -- show log (not in ChangeLog format) &#26174;&#31034;&#26085;&#24535;,&#21482;&#26174;&#31034;&#24403;&#21069;&#25991;&#20214;&#26377;&#20851;&#30340;&#26085;&#24535;
;; &#36825;&#20010;&#25171;&#24320;&#30340;&#26085;&#24535;buffer &#21151;&#33021;&#32477;&#23545;&#19981;&#27490;&#26174;&#31034;&#26085;&#24535;&#36825;&#20040;&#31616;&#21333;&#65292;
;; &#20320;&#21487;&#20197;&#25353;&#19979;C-hb &#26597;&#30475;&#19968;&#19979;&#23427;&#30340;&#38190;&#32465;&#23450;&#65292;
;; &#27604;&#22914;= &#26159;&#36827;&#34892;diff&#27604;&#36739;&#65292;&#40664;&#35748;&#26159;&#26368;&#26032;&#30340;&#29256;&#26412;&#65292;&#19982;&#20320;&#20809;&#26631;&#19979;&#30340;&#29256;&#26412;&#36827;&#34892;&#27604;&#36739;
;; &#20063;&#21487;&#20197;&#29992;m ,mark &#20004;&#20010;&#29256;&#26412;&#21518;&#65292;&#28982;&#21518;= ,&#23558;&#20854;&#36827;&#34892;&#27604;&#36739;
;; C-x v L     `vc-print-root-log' &#26174;&#31034;&#26085;&#24535;,&#26174;&#31034;&#25152;&#26377;&#26085;&#24535;
;; &#22312;*vc-change-log*buffer &#20013;&#21487;&#20197;&#36827;&#34892;&#20197;&#19979;&#25805;&#20316;
;; `p' &#36339;&#36716;&#21040;&#21069;&#19968;&#20010;&#26085;&#24535;&#26465;&#30446;
;; `n' &#36339;&#36716;&#21040;&#19979;&#19968;&#20010;&#26085;&#24535;&#26465;&#30446;
;; `P'
;;      Move to the log of the previous file, when the logs of multiple
;;      files are in the log buffer (*note VC Directory Mode::).
;;      Otherwise, just move to the beginning of the log.  A numeric
;;      prefix argument is a repeat count, so `C-u 10 P' would move
;;      backward 10 files.
;; `N'
;;      Move to the log of the next file, when the logs of multiple files
;;      are in the log buffer (*note VC Directory Mode::).  It also takes a
;;      numeric prefix argument as a repeat count.

;;`a'  &#23545;&#24403;&#21069;&#23545;&#24212;&#30340;&#29256;&#26412;&#36827;&#34892;annotate &#25805;&#20316;,&#35814;&#35265;`C-xvg' ,&#19979;&#38754;&#26377;&#27880;&#37322;
;; e   &#37325;&#26032;&#32534;&#36753;&#24403;&#21069;&#30340;&#26085;&#24535;&#20869;&#23481;,&#24182;&#19981;&#26159;&#25152;&#26377;&#30340;&#31649;&#29702;&#24037;&#20855;&#37117;&#25903;&#25345;
;; f   &#26597;&#30475;&#24341;&#29256;&#26412;&#30340;&#25991;&#20214;&#23545;&#24212;&#30340;&#20869;&#23481;,&#30456;&#24403;&#20110;`C-xv~' &#28982;&#21518;&#36755;&#20837;&#29256;&#26412;&#21495;&#30340;&#25805;&#20316;,&#23545;git &#26469;&#35828;&#27604;`C-xv~'&#26041;&#20415;
;; d   diff &#23545;&#27492;&#29256;&#26412;&#19982;&#21069;&#19968;&#20010;&#29256;&#26412;&#30340;&#24403;&#21069;&#25991;&#20214;diff&#25805;&#20316;
;; D   diff ,&#21516;d ,&#19981;&#36807;&#26159;&#25152;&#26377;&#30340;&#25991;&#20214;,
;; ChangeLog &#25991;&#20214;
;;`C-x4a' &#22312;ChangeLog&#25991;&#20214;&#20013;&#28155;&#21152;&#19968;&#20010;&#26465;&#30446;,&#20851;&#20110;&#24403;&#21069;&#25991;&#20214;&#30340;&#20462;&#25913;&#30340;,&#24403;&#21069;&#26085;&#26399;&#30340;.
;;`C-xva' &#26681;&#25454;version control &#26085;&#24535;&#33258;&#21160;&#29983;&#25104;ChangeLog,&#19981;&#36807;svn git &#30446;&#24405;&#36824;&#19981;&#25903;&#25345;.
;;&#22312;&#32534;&#36753;ChangeLog&#26102;
;;`C-j' &#33258;&#21160;&#32553;&#36827;
;;C-x`  &#25171;&#24320;&#27492;&#26465;&#30446;&#23545;&#24212;&#30340;&#25991;&#20214;
;; `C-xvd' vc-dir  &#22810;&#25991;&#20214;&#25805;&#20316;
;; C-x v d     vc-directory -- show all files which are not up to date
;;             &#25805;&#20316;&#26377;&#28857;&#31867;&#20284;dired ,&#23427;&#26159;VC &#25903;&#25345;&#22810;&#25991;&#20214;&#25805;&#20316;&#30340;&#26041;&#24335;,&#22312;*vc-dir* buffer &#20013;&#20250;&#26174;&#31034;&#22788;&#20110;version control&#31649;&#29702;&#19979;&#30340;&#25991;&#20214;
;;             &#19981;&#36807;&#40664;&#35748;up-to-date &#30340;&#25991;&#20214;&#21450;&#30456;&#24212;&#30340;&#23376;&#30446;&#24405;&#20250;&#34987;&#38544;&#34255;,&#20363;&#22806;&#26159;&#36825;&#20010;up-to-date &#30340;&#25991;&#20214;&#26159;&#21018;&#21018;&#34987;&#20320;&#25552;&#20132;&#23548;&#33268;&#30340;,&#21017;&#19981;&#38544;&#34255;.
;;            &#20854;&#26684;&#24335;&#22914;&#19979;
;;           ./
;;           modified           file1.c
;;           needs-update       file2.c
;;           needs-merge        file3.c
;;           unregistered        g.c

;;           &#20854;&#20013;&#24456;&#22810;&#21629;&#20196;&#31867;&#20284;&#20110;dired
;;           n p TAB SPC &#19978;&#19979;&#31661;&#22836;&#36827;&#34892;&#23548;&#33322;
;;           `RET' &#21644;f &#25171;&#24320;&#30456;&#24212;&#25991;&#20214; ,o &#22312;&#21478;&#22806;&#19968;&#20010;&#31383;&#21475;&#25171;&#24320;
;;           q &#36864;&#20986;
;;           x &#38544;&#34255;&#25152;&#26377;up-to-date&#30340;&#25991;&#20214;
;;           m &#23545;&#25991;&#20214;&#36827;&#34892;&#26631;&#35760;,&#28982;&#21518;&#21487;&#20197;&#23545;&#26631;&#35760;&#30340;&#25991;&#20214;&#36827;&#34892;&#25805;&#20316;,&#22914;commit&#25552;&#20132;
;;          `M' &#26631;&#35760;&#25152;&#26377;&#19982;&#24403;&#21069;&#25991;&#20214;&#29366;&#24577;&#30456;&#21516;&#30340;&#25991;&#20214;
;;           u &#19982;U&#21017;&#26159;m M&#30456;&#21453;&#30340;&#25805;&#20316;
;;           &#23545;&#26631;&#35760;&#30340;&#25991;&#20214;&#25110;&#32773;&#24403;&#21069;&#25991;&#20214;&#30340;&#20869;&#23481;&#36827;&#34892;&#25628;&#32034;&#26367;&#25442;
;;           `S' searches the marked files.
;;           `Q' does a query replace on the marked files.
;;           `M-s a C-s' does an incremental search on the marked files.
;;           `M-s a C-M-s' does an incremental search on the marked files.
;;
;;           &#21478;&#22806;&#20197;`C-xv'&#20026;&#21069;&#32512;&#30340;&#21629;&#20196;&#22312;vc-dir buffer&#20013;&#37117;&#26377;&#23545;&#24212;&#30340;&#30701;&#30340;&#38190;&#32465;&#23450;
;;           &#22914;l &#23545;&#24212; `C-xvl' &#26597;&#30475;&#26085;&#24535;
;;            `=', `+'`l', `i',`v'
;;           &#23545;&#22810;&#25991;&#20214;&#36827;&#34892;&#25805;&#20316;&#26102;,&#25991;&#20214;&#24517;&#39035;&#22788;&#20110;&#30456;&#21516;&#30340;&#29366;&#24577;,&#25110;&#32773;&#20860;&#23481;&#24577;
;;            (added, modified and removed states &#20026;&#20860;&#23481;&#24577;
;; `C-xvg' vc-annotate &#26597;&#30475;&#26576;&#20010;&#29305;&#23450;&#25991;&#20214;&#33258;&#22987;&#33267;&#32456;&#30340;&#21464;&#21270;
;;&#20301;&#20110;info &#30340;Emacs&gt;&gt;Maintaining&gt;&gt;Version Control&gt;&gt;Old Revisions
;; C-x v g     vc-annotate -- show when each line in a tracked file was added and by whom
;;`C-uC-xvg' &#21017;&#19981;&#26159;&#23545;&#40664;&#35748;&#30340;&#24403;&#21069;buffer&#36827;&#34892;&#25805;&#20316;,&#35753;&#20320;&#36873;&#25321;?
;;&#26576;&#19968;&#20010;&#29305;&#23450;&#29256;&#26412;&#25991;&#20214;&#30340;&#20869;&#23481;&#22312;&#19981;&#21516;&#30340;&#29256;&#26412;&#37117;&#26377;&#22686;&#20943;,&#32780;vc-annotate &#29992;&#19981;&#21516;&#30340;&#39068;&#33394;&#34920;&#31034;&#25991;&#20214;&#20013;&#19981;&#21516;
;;&#20195;&#30721;&#30340;&#21382;&#21490;, &#32418;&#33394;&#30340;&#37096;&#20998;&#26159;&#26368;&#36817;&#25165;&#28155;&#21152;&#30340;,&#34013;&#33394;&#30340;&#21017;&#26159;&#26368;&#21021;&#23601;&#21152;&#20837;&#30340;&#20869;&#23481;,&#20013;&#38388;&#36807;&#31243;&#28155;&#21152;&#30340;&#20195;&#30721;&#20063;&#20250;&#29992;&#19981;&#21516;&#30340;&#39068;&#33394;&#36827;&#34892;&#26631;&#35760;

;;*Annotate* buffer &#30340;&#26684;&#24335;&#26159;:&#21491;&#36793;&#26159;&#20195;&#30721;,&#24038;&#36793;&#21017;&#26159;&#21491;&#36793;&#27599;&#19968;&#34892;&#20195;&#30721;&#25152;&#23545;&#24212;&#30340;&#29256;&#26412;,&#20063;&#23601;&#26159;&#20195;&#34920;&#20102;&#36825;&#19968;&#34892;&#20195;&#30721;&#26159;&#22312;&#21738;&#20010;&#29256;&#26412;
;;&#30340;&#26102;&#20505;&#28155;&#21152;&#36827;&#26469;&#30340;.
;;&#36827;&#20837;Annotate mode &#21518;&#36824;&#21487;&#20197;&#36827;&#34892;&#20854;&#20182;&#25805;&#20316;

;;p  &#23545;&#27492;&#25991;&#20214;&#30340;&#19978;&#19968;&#20010;&#29256;&#26412;&#36827;&#34892;vc-annotate&#25805;&#20316;
;;n  ........&#19979;........................
;;j &#23545;`&#24403;&#21069;&#34892;' &#25152;&#23545;&#24212;&#30340;&#29256;&#26412;&#30340;&#24403;&#21069;&#25991;&#20214;&#36827;&#34892;vc-annotate&#25805;&#20316;,&#27604;&#22914;&#24403;&#21069;&#34892;&#30340;&#20195;&#30721;&#26159;&#22312;&#29256;&#26412;&#21495;&#20026;3&#30340;&#26102;&#20505;&#28155;&#21152;&#36827;&#26469;&#30340;,
;;  &#21017;&#27492;&#25805;&#20316;&#20250;&#23545;&#27492;&#25991;&#20214;&#29256;&#26412;&#20026;3&#26102;&#30340;&#20869;&#23481;&#36827;&#34892;vc-annotate&#25805;&#20316;
;;w  &#36890;&#36807;p n j &#25805;&#20316;&#21518;&#26377;&#21487;&#33021;&#20320;&#24536;&#35760;&#20102;&#24403;&#21069;buffer&#20013;&#30340;&#20869;&#23481;&#21040;&#24213;&#26159;&#21738;&#20010;&#29256;&#26412;&#30340;,&#21487;&#20197;&#29992;w &#22238;&#21040;&#26368;&#21021;&#36816;&#34892;`C-xvg' &#26102;&#30340;&#29256;&#26412;
;;   w &#34920;&#31034;working revision &#20854;&#23454;&#23601;&#26159;&#26368;&#26032;&#30340;&#19968;&#20010;&#29256;&#26412;

;;a `&#24403;&#21069;&#34892;' &#21017;&#30456;&#24403;&#20110;&#20808;&#36827;&#34892;j&#25805;&#20316;,&#28982;&#21518;&#36827;&#34892;p&#25805;&#20316;,&#20854;&#20316;&#29992;&#26159;&#26597;&#30475;&#36824;&#27809;&#26377;&#21152;&#20837;&#24403;&#21069;&#34892;&#30340;&#20869;&#23481;&#26102;&#30340;&#21069;&#19968;&#20010;&#29256;&#26412;&#23545;&#24212;&#30340;&#25991;&#20214;&#26159;&#20160;&#20040;&#26679;&#23376;&#30340;
;;f `&#24403;&#21069;&#34892;' file&#36319;j&#31867;&#20284;,&#19981;&#36807;&#19981;&#36827;&#34892;vc-annotate&#25805;&#20316;,&#20165;&#26174;&#31034;&#24403;&#21069;&#34892;&#23545;&#24212;&#29256;&#26412;&#30340;&#25991;&#20214;&#20869;&#23481;
;;d `&#24403;&#21069;&#34892;' diff&#25805;&#20316;,&#24403;&#21069;&#34892;&#23545;&#24212;&#19968;&#20010;&#29256;&#26412;,&#29992;&#27492;&#29256;&#26412;&#19982;&#23427;&#30340;&#21069;&#19968;&#20010;&#29256;&#26412;&#36827;&#34892;diff&#25805;&#20316;,&#21363;&#26597;&#30475;&#21040;&#24213;&#36825;&#19968;&#27425;&#30340;&#29256;&#26412;&#21464;&#21270;&#26377;&#21738;&#20123;&#21464;&#21270;
;;D `&#24403;&#21069;&#34892;' diff&#25805;&#20316;,&#19982;d&#31867;&#20284;,&#19981;&#36807;&#27492;&#27425;&#26174;&#31034;&#30340;&#19981;&#20165;&#26159;&#24403;&#21069;&#25991;&#20214;&#30340;diff,&#32780;&#26159;&#27492;&#27425;&#25552;&#20132;&#25152;&#26377;&#25991;&#20214;&#30340;&#21464;&#21270;.
;;l `&#24403;&#21069;&#34892;' log &#26174;&#31034;&#26085;&#24535; ,&#26174;&#31034;&#24403;&#21069;&#34892;&#25152;&#23545;&#24212;&#30340;&#29256;&#26412; &#30456;&#24212;&#30340;&#26085;&#24535;
;;v &#40664;&#35748;&#21491;&#36793;&#20195;&#30721;&#24038;&#36793;&#29256;&#26412;&#21495;,v &#21017;toggle &#26159;&#21542;&#26174;&#31034;&#29256;&#26412;&#21495;,&#29992;&#22788;&#19981;&#22823;.

;; (C-x C-q    by default, C-x C-q is no longer bound, so it's better to use the above binding)
;; C-x v c     vc-cancel-version -- delete the latest revision (often it makes more sense to look at an old revision
;;             and check that in again!) &#22238;&#28378;&#25805;&#20316;
;;             git svn &#29616;&#22312;&#36824;&#19981;&#25903;&#25345;,

;; C-x v s     vc-create-snapshot -- tag all the files with a symbolic name ,
;;             &#21019;&#24314;&#26631;&#31614;tag ,git &#30456;&#24403;&#20110;git tag newTAGname
;; C-x v r     vc-retrieve-snapshot -- undo checkouts and return to a snapshot with a symbolic name
;;             git &#30456;&#24403;&#20110;git checkout newTAGname ,&#20250;&#22788;&#20110;&#19968;&#20010;&#26080;&#21517;&#30340;branch &#27492;&#26102;work dir&#20013;&#30340;&#25991;&#20214;&#37117;&#26159;tagName&#26102;&#30340;&#29256;&#26412;

;; C-x v a     vc-update-change-log -- update ChangeLog

;; C-x v m     vc-merge
;; C-x v h     vc-insert-headers

;; VC-LOG

;;&#20851;&#20110;*VC-LOG*  &#36827;&#20837;&#36825;&#20010;buffer &#21518;
;; `C-cC-c' &#23436;&#25104;&#26085;&#24535;&#30340;&#22635;&#20889;,commit.
;; `C-cC-f' &#26174;&#31034;&#36825;&#27425;&#25552;&#20132;&#26377;&#21738;&#20123;&#25991;&#20214;&#20316;&#20102;&#20462;&#25913;,&#19981;&#36807;&#22914;&#26524;&#26159;&#22312;&#30452;&#25509;&#32534;&#36753;&#26576;&#20010;work file&#26102;&#25191;&#34892;`C-xvv' &#21017;&#26174;&#31034;&#30340;&#20165;&#26159;&#24403;&#21069;work file
;;          &#29992;&#22788;&#19981;&#22823;,&#22914;&#26524;&#26159;&#22312;`C-xvd'&#36827;&#20837;vc-dir&#27169;&#24335;&#36827;&#34892;&#22810;&#25991;&#20214;&#25805;&#20316;&#21518;,&#25191;&#34892;`C-xvv'&#36827;&#20837;vc-log&#21017;`C-cC-f'&#26174;&#31034;&#30340;&#25165;&#26159;&#25805;&#20316;&#30340;&#22810;&#25991;&#20214;
;; `C-cC-d' &#26174;&#31034;diff.
;;  &#22312;minibuffer&#20013;&#25105;&#20204;&#21487;&#20197;&#29992;`M-p'&#21069;&#19968;&#20010; `M-n'&#19979;&#19968;&#20010; `M-r'&#21521;&#21518;&#25628;&#32034; `M-s'&#21521;&#21069;&#25628;&#32034; &#31561;&#26597;&#30475;&#20197;&#24448;&#30340;&#21382;&#21490;,
;;  &#21516;&#26679;&#22312;*VC-LOG*&#20013;&#20063;&#21487;&#20197;&#26597;&#30475;&#20197;&#24448;&#30340;&#25552;&#20132;&#21382;&#21490;.&#25805;&#20316;&#30456;&#21516;.


;; merge &#25991;&#20214;&#30340;&#21512;&#24182; ,&#24863;&#35273;&#26377;&#20102;ediff&#65292;&#36825;&#20010;&#24037;&#20855;&#22522;&#26412;&#29992;&#19981;&#21040;
;; `M-x emerge-files'  ;;&#27604;&#36739;&#20004;&#20010;&#25991;&#20214;,
;; `M-x emerge-files-with-ancestor';;&#27604;&#36739;&#20004;&#20010;&#25991;&#20214;,&#23427;&#20204;&#37117;&#26159;&#20174;&#26576;&#19968;&#20010;&#31062;&#20808;&#25991;&#20214;&#21464;&#21270;&#26469;&#30340;.
;; `M-x emerge-buffers'
;; `M-x emerge-buffers-with-ancestor'
;;&#36816;&#34892;&#20197;&#19978;&#21629;&#20196;&#20250;&#25171;&#24320;&#19977;&#20010;buffer:A,B and *merge*, merge&#21518;&#21487;&#20197;`C-xC-w'&#20445;&#23384;merge&#21518;&#30340;&#25991;&#20214;
;;*merge* buffer&#20013;&#40664;&#35748;&#30340;&#20869;&#23481;&#26159;A&#30340;,&#21487;&#20197;&#29992;n ,p &#20381;&#27425;&#21015;&#20986;&#19982;B&#25991;&#20214;&#30340;&#19981;&#21516;&#20043;&#22788;,&#19981;&#21516;&#20043;&#22788;&#20250;&#29992;
;;     vvvvvvvvvvvvvvvvvvvv
;;     TEXT THAT DIFFERS
;;     ^^^^^^^^^^^^^^^^^^^^
;;a,b            &#23383;&#27597;v&#25110;^&#22841;&#22312;&#20013;&#38388;,&#27492;&#26102;&#21487;&#20197;&#29992;a &#25110;&#32773;b&#25353;&#38190; ,&#20915;&#23450;merge&#21518;&#30340;&#25991;&#20214;&#26159;&#36873;&#29992;A&#20013;&#30340;&#20869;&#23481;&#36824;&#26159;B&#20013;&#30340;&#20869;&#23481;
;;n,p         &#36873;&#20013;&#20043;&#21518;v^ &#23383;&#26679;&#23601;&#20250;&#28040;&#22833;,&#28982;&#21518;&#21487;&#20197;&#32487;&#32493;&#29992;n ,p&#26174;&#31034;&#19979;&#19968;&#22788;&#25110;&#19978;&#19968;&#22788;&#30340;&#19981;&#21516;(diff),&#30452;&#33267;&#26174;&#31034;&#23436;&#25152;&#26377;&#30340;&#19981;&#21516;
;;            merge &#23601;&#31639;&#23436;&#27605;`C-xC-w'&#20445;&#23384;&#21518;&#21363;&#21487;.`C-]'&#21017;&#25918;&#24323;&#21512;&#24182;.
;;`C-uNj'     &#38500;&#20102;n p&#21629;&#20196;&#22806;`C-uNj' &#21487;&#20197;&#36339;&#36716;&#21040;&#31532;N&#20010;diff&#22788;,N&#26159;&#25968;&#23383;
;;'.'         &#21017;&#26159;&#26174;&#31034;&#20809;&#26631;&#24403;&#21069;&#20301;&#32622;&#30340;diff(&#29992;vvv^^^&#23383;&#26679;&#25324;&#36215;&#26469;,)&#27809;&#26377;&#19981;&#21516;&#20043;&#22788;&#21017;&#19981;&#26174;&#31034;`C-u.'&#21516;"."&#19981;&#36807;
;;            &#24403;&#21069;&#20301;&#32622;&#22914;&#26080;diff&#21017;&#26174;&#31034;&#31532;&#36817;&#22788;&#30340;diff.
;; q          &#36864;&#20986;
;;`C-]'       &#36864;&#20986;abort
;; e          &#36807;&#20837;"Edit mode" ,&#27492;&#26102;&#21487;&#20197;&#25163;&#21160;&#36755;&#20837;&#20869;&#23481;,&#36827;&#20837;"Edit mode"&#21518;&#19978;&#38754;&#30340;&#21629;&#20196;&#20381;&#28982;&#26377;&#25928;&#19981;&#36807;&#35201;&#21152;`C-cC-c'&#21069;&#32512;
;;`C-cC-cf'   &#22238;&#21040;"Fast mode" &#19982;e&#21629;&#20196;&#30456;&#21453;,
;; l          recenter &#21516;`C-l' &#37325;&#26032;&#35843;&#25972;&#19977;&#20010;buffer&#20013;&#30340;&#20869;&#23481;,
;; `da'       &#36873;&#25321;A&#25991;&#20214;&#30340;&#20869;&#23481;&#20316;&#23481;&#40664;&#35748;"*merge*"buffer&#20013;&#30340;&#20869;&#23481;
;; `db'       &#21516;`da'
;;  `ca' `cb' copy A&#25110;B&#20013;&#30340;&#20869;&#23481;&#26159;kill ring
;; `ia' `ib'   &#25554;&#20837;A(B)&#20013;&#30340;&#24403;&#21069;diff&#21040;&#20809;&#26631;&#22788;
;; m           &#36873;&#20013;diff&#20013;&#30340;&#20869;&#23481;,put the 'marker' and 'point' around diff.
;; &#22235;&#20010;&#28378;&#21160;&#31383;&#21475;&#30340;&#21629;&#20196;
;; `^'         Scroll all three windows down (like `M-v').
;; `v'         Scroll all three windows up (like `C-v').
;; `&lt;'         Scroll all three windows left (like `C-x &lt;').
;; `&gt;'         Scroll all three windows right (like `C-x &gt;').
;;
;; `|'         Reset horizontal scroll on all three windows.

;; `x1'       &#25910;&#32553;"merge" &#31383;&#21475;&#21482;&#26174;&#31034;&#19968;&#34892;,(`C-ul'&#24674;&#22797;)

;;`xc'        combine&#21512;&#24182;&#20004;&#22788;&#30340;diff&#20869;&#23481;
;;`xf'       &#26174;&#31034;&#27491;&#23384;&#27604;&#36739;&#30340;&#20004;&#20010;&#25991;&#20214;&#30340;&#21517;&#23383;,(`C-ul'&#24674;&#22797;)

;;`xj'       &#21512;&#24182;&#24403;&#21069;diff&#19982;&#19979;&#19968;&#20010;diff ,`C-uxj'&#21017;&#26159;&#19982;&#21069;&#19968;&#20010;&#36827;&#34892;&#21512;&#24182;

;;`xs'         &#20998;&#35299;&#24403;&#21069;diff&#20026;&#20004;&#20010;diff.

;;`xt'        Trim identical lines off the top and bottom of the difference.
;;            Such lines occur when the A and B versions are identical but
;;            differ from the ancestor version.
;; diff

;; &#20851;&#20110;diff ,patch &#34917;&#19969;&#30340;&#20351;&#29992;

;;&#26377;&#19968;&#20010;&#26087;&#30340;&#25991;&#20214;a , &#20320;&#32534;&#36753;&#20102;a&#23558;&#36825;&#20010;&#32534;&#36753;&#21518;&#30340;&#25991;&#20214;&#21629;&#20196;&#20026;b
;;&#29616;&#22312;&#24819;&#29983;&#25104;&#19968;&#20010;&#34917;&#19969;&#25991;&#20214;,&#23558;&#36825;&#20010;&#34917;&#19969;&#25991;&#20214;&#24212;&#29992;&#21040;a &#19978;,&#23601;&#20250;&#21464;&#25104;b
;;&#29983;&#25104;&#36825;&#20010;&#34917;&#19969;&#25991;&#20214;&#30340;&#21629;&#20196;&#26159;diff
;; diff -ubB a b&gt;a.patch  (-u&#25351;&#23450;&#29983;&#25104;&#30340;&#26684;&#24335;,-b&#24573;&#30053;&#31354;&#26684;-B&#24573;&#30053;&#31354;&#26684;&#24341;&#36215;&#30340;&#24046;&#24322;)
;;&#36825;&#26679;&#22312;&#24403;&#21069;&#30446;&#24405;&#19979;&#20250;&#29983;&#25104;a.patch&#30340;&#25991;&#20214;,
;;&#36825;&#26679;&#20320;&#21487;&#20197;&#23558;&#20320;&#30340;&#34917;&#19969;&#25991;&#20214;&#21457;&#24067;&#21040;&#32593;&#19978;,&#21035;&#20154;&#25343;&#21040;&#20320;&#30340;&#34917;&#19969;&#21450;a&#25991;&#20214; &#25918;&#22312;&#21516;&#19968;&#20010;&#30446;&#24405;
;;patch -p0 &lt;a.patch a  &#36825;&#26679;&#25171;&#19978;&#34917;&#19969;&#21518;,a&#20013;&#30340;&#20869;&#23481;&#23601;&#19982;b&#20013;&#30340;&#20869;&#23481;&#26080;&#24322;
;;&#21487;&#26159;&#20320;&#21518;&#24724;&#20102;,&#19981;&#36215;&#25171;&#36825;&#20010;&#34917;&#19969;,&#24819;&#23601;a&#24674;&#22797;&#21407;&#26679;
;;patch -R &lt;a.patch a  &#36825;&#26679;a&#25991;&#20214;&#23601;&#21464;&#25104;&#20102;&#26368;&#21021;&#30340;&#27169;&#26679;&#20102;.
;;diff mode &#20687;Compilation mode &#19968;&#26679;,&#21487;&#20197;&#29992;C-x` `C-cC-c' &#22312;&#21508;&#20010;&#26465;&#30446;&#38388;&#36339;&#36716;

(setq diff-switches "-ubB")
;;&#27880;&#24847;linux&#19979;&#30340;diff a b ,&#20854;&#20013;a &#26159;&#26087;&#25991;&#20214;,b&#26159;&#26032;&#25991;&#20214;
;;&#22312;Emacs&#20013;`M-x' diff  &#20808;&#23601;&#20320;&#36873;&#25321;&#30340;&#26159;b&#28982;&#21518;&#25165;&#26159;a
;; &#19968;&#20010;hunk &#23601;&#26159;&#19968;&#22788;: @@ -130,7 +130,7 @@

;; `M-n' &#36339;&#21040;&#19979;&#19968;&#20010;&#24046;&#24322;&#22788;(hunk)
;; `M-p' &#36339;&#21040;&#19978;&#19968;&#20010;&#24046;&#24322;&#22788;(hunk)
;; `M-}' &#36339;&#21040;&#19979;&#19968;&#20010;&#25991;&#20214; (&#22312;&#22810;&#25991;&#20214;&#34917;&#19969;&#20013;)
;; `M-{'
;; `M-k' &#21024;&#38500;&#36825;&#20010;(hunk)
;; `M-K' &#21024;&#38500;&#20851;&#20110;&#36825;&#20010;&#25991;&#20214;&#30340;(hunk)
;;`C-cC-a' &#23558;&#24403;&#21069;&#30340;hunk&#25171;&#21040;&#26087;&#25991;&#20214;&#20013; `diff-apply-hunk'
;;          `C-u' &#21017;&#36827;&#34892;&#30456;&#21453;&#30340;&#25805;&#20316;,&#27880;&#24847;&#22914;&#26524;&#36825;&#20010;hunk&#24050;&#32463;&#25171;&#36807;
;;          &#20877;&#36816;&#34892;`C-cC-a'&#20250;&#38382;&#20320;&#26159;&#21542;reverse&#21453;&#21521;&#25805;&#20316;

;;`C-cC-b' &#39640;&#20142;&#26174;&#31034;&#21040;&#26102;&#24213;&#26377;&#21738;&#20123;&#21024;&#20943;`diff-refine-hunk'

;;`C-cC-c' &#26597;&#30475;&#26087;&#30340;&#25991;&#20214;`diff-goto-source'
;;`C-cC-e' &#36215;&#19968;&#20010;Ediff&#20250;&#35805;`diff-ediff-patch'
;;`C-cC-n' `diff-restrict-view' &#23601;&#26159;Narrowing ,&#21482;&#26174;&#31034;&#24403;&#21069;hunk&#30340;&#20869;&#23481;`C-xnw' &#30456;&#21453;&#25805;&#20316;widen&#20043;
;;         `C-u',&#21017;&#23545;&#25991;&#20214;&#32780;&#38750;hunk
;;`C-cC-r'  `diff-reverse-direction' &#20132;&#25442;&#26032;&#32769;&#25991;&#20214;(diff a b &#21464;&#25104;diff b a)
;;

;; `C-c C-s'
;;      Split the hunk at point (`diff-split-hunk').  This is for manually
;;      editing patches, and only works with the "unified diff format"
;;      produced by the `-u' or `--unified' options to the `diff' program.
;;      If you need to split a hunk in the "context diff format" produced
;;      by the `-c' or `--context' options to `diff', first convert the
;;      buffer to the unified diff format with `C-c C-u'.

;; `C-c C-d'
;;      Convert the entire buffer to the "context diff format"
;;      (`diff-unified-&gt;context').  With a prefix argument, convert only
;;      the text within the region.
;; `C-c C-u'
;;      Convert the entire buffer to unified diff format
;;      (`diff-context-&gt;unified').  With a prefix argument, convert
;;      unified format to context format.  When the mark is active, convert
;;      only the text within the region.

;; `C-c C-w' &#37325;&#26032;&#29983;&#25104;diff&#25991;&#20214;,&#27492;&#27425;&#24573;&#30053;&#31354;&#26684;
;;      Refine the current hunk so that it disregards changes in whitespace
;;      (`diff-refine-hunk').

;; `C-x 4 A'
;;      Generate a ChangeLog entry, like `C-x 4 a' does (*note Change
;;      Log::), for each one of the hunks
;;      (`diff-add-change-log-entries-other-window').  This creates a
;;      skeleton of the log of changes that you can later fill with the
;;      actual descriptions of the changes.  `C-x 4 a' itself in Diff mode
;;      operates on behalf of the current hunk's file, but gets the
;;      function name from the patch itself.  This is useful for making
;;      log entries for functions that are deleted by the patch.
;; `M-x diff-show-trailing-whitespaces RET'
;;      Highlight trailing whitespace characters, except for those used by
;;      the patch syntax (*note Useless Whitespace::).
(eval-after-load 'diff-mode
  ;;&#20026;*Diff* mode &#35774;&#32622;&#39640;&#24230;face
  '(require 'diff-mode-)
  )
;; Ediff
(setq-default ediff-window-setup-function (quote ediff-setup-windows-plain))
;;Ediff&#24120;&#29992;&#30340;&#21629;&#20196;
;; `ediff-files' `ediff-current-file' `ediff-directories'
;; `edir-revisions' `edir-merge-revisions' `ediff-show-registry'
;; `edir-merge-revisions-with-ancestor'
;; `ediff-revision' `ediff-patch-file'
;; `ediff-merge-files' `ediff-merge-files-with-ancestor'
;; `ediff-merge-directories' `ediff-merge-revisions'

;; `v'            scroll A and B
;; `V'            scroll the buffers down
;; `wd'           write diff to a file
;; `wb' `wc'`wa'  Saves buffer A, if it was modified.
;; `a'  `b' `c'   &#25226;A&#20013;&#30456;&#21069;&#30340;&#30340;difference region copy&#21040;B&#20013;&#30456;&#24212;&#30456;&#24212;&#20301;&#32622;,`rb' &#21487;&#20197;&#24674;&#22797;B&#21040;&#21407;&#29366;
;; `ab'           &#21516;`a'&#19981;&#36807;&#26159;&#22312;3&#20010;&#25991;&#20214;&#23545;&#27604;&#30340;&#26102;&#20505;
;; `p' `n'         &#36873;&#20013;&#19978;&#19968;&#20010;(&#19979;&#19968;&#20010;)difference region
;; `j' `-j' `Nj';; `n' &#19982;'p'&#26159;&#30456;&#23545;&#36339;&#36716;,&#27492;&#20026;&#32477;&#23545;&#36339;&#36716;,N&#26159;&#25968;&#23383;,&#34920;&#31034;&#36339;&#21040;&#31532;N&#20010;difference region,
;; -j&#34920;&#31034;&#36339;&#21040;&#36339;&#21518;
;; `ga'              &#23558;A&#20013;&#36339;(point)&#26368;&#36817;&#30340;difference region&#36873;&#20013;
;; `!'               Recomputes the difference regions ,&#38450;&#27490;&#22240;&#20026;&#20462;&#25913;&#23548;&#33268;&#39640;&#20142;&#20986;&#38169;
;;  `m'             &#35843;&#25972;&#31383;&#21475;&#22312;&#22823;&#23567;&#23613;&#37327;&#22823;(toggle
;;   `|'            toggle &#26159;&#27700;&#24179;&#36824;&#26159;&#22402;&#30452;&#25670;&#25918;&#20004;&#20010;window
;;   'r'            &#37325;&#32622;merge&#20013;&#30340;&#20869;&#23481;&#21040;&#26410;&#20462;&#25913;&#21069;(&#21482;&#22312;merge&#20250;&#35805;&#20013;&#26377;&#29992;)
;;   `ra' `rb' `rc' ::: `a' `b' `c' undo&#25805;&#20316; (&#21482;&#22312;compare&#20250;&#35805;&#20013;&#26377;&#29992;)
;;   `##'          &#36339;&#36807;&#21482;&#22240; &#31354;&#26684;TAB&#19981;&#21516;&#24341;&#36215;&#30340;difference
;;   `#c'          &#36339;&#36807;&#21482;&#22240; &#22823;&#23567;&#20889;&#19981;&#21516;&#24341;&#36215;&#30340;difference
;;`#h' `#f'       &#22788;&#29702;&#22240;&#20026;&#22823;&#37327;&#30456;&#21516;&#30340;&#21464;&#37327;&#26367;&#25442;&#24341;&#36215;&#30340;difference
;;`A' `B' `C'    toggle Read-Only in A(B,C)
;; ~             &#20132;&#25442;A B&#31383;&#21475;
;; i            &#26174;&#31034;&#24403;&#21069;&#36827;&#34892;&#30340;Ediff Session&#30340;&#20449;&#24687;,&#22914;&#22312;&#23545;&#21738;&#20004;&#20010;&#25991;&#20214;&#36827;&#34892;&#23545;&#27604;&#31561;
;; D             &#26174;&#31034;diff&#21629;&#20196;&#30340;&#36755;&#20986;&#32467;&#26524;,&#29983;&#25104;diff&#25991;&#20214;
;; R             &#26174;&#31034;&#25152;&#26377;&#21487;&#29992;&#30340;Ediff Session,&#22522;&#26412;&#23601;&#26159;&#21382;&#21490;&#27983;&#35272;`ediff-show-registry'
;; z            &#26242;&#26102;&#25346;&#36215;,(&#20851;&#38381;&#30456;&#20851;&#31383;&#21475;,) &#21487;&#20197;`R' &#36827;&#34892;&#24674;&#22797;&#20250;&#35805;
;; q               quit.
;;`/' Displays the ancestor file during merges.
;; s            &#25910;&#32553;merge&#31383;&#21475;(toggle) ,`4s' &#21017;&#22686;&#22823;4&#34892;
;; +            &#21512;&#24182;A B &#30340;&#24403;&#21069; difference region
;; =           &#21551;&#29992;&#19968;&#20010;&#26032;&#30340;&#23376;&#20250;&#35805;&#23545;&#24403;&#21069;difference region&#36827;&#34892;&#23545;&#27604;

;;git mergetool &#20351;&#29992;ediff ,&#21069;&#25552;&#21487;&#20197;&#27491;&#24120;&#20351;&#29992;emacsclient ,&#24182;&#19988;Emacs&#24050;&#32463;&#21551;&#21160;&#12290;
;; ~/.gitconfig
;; [mergetool "ediff"]
;; cmd = emacsclient --eval \"(git-mergetool-emacsclient-ediff \\\"$LOCAL\\\" \\\"$REMOTE\\\" \\\"$BASE\\\" \\\"$MERGED\\\")\"
;; trustExitCode = false
;; [mergetool]
;; prompt = false
;; [merge]
;; tool = ediff
;;
;; Setup for ediff.
;;
;;(require 'ediff)

(defvar ediff-after-quit-hooks nil
  "* Hooks to run after ediff or emerge is quit.")

(defadvice ediff-quit (after edit-after-quit-hooks activate)
  (run-hooks 'ediff-after-quit-hooks))

(setq git-mergetool-emacsclient-ediff-active nil)

(defun local-ediff-frame-maximize ()
  (when (boundp 'display-usable-bounds)
    (let* ((bounds (display-usable-bounds))
           (x (nth 0 bounds))
           (y (nth 1 bounds))
           (width (/ (nth 2 bounds) (frame-char-width)))
           (height (/ (nth 3 bounds) (frame-char-height))))
      (set-frame-width (selected-frame) width)
      (set-frame-height (selected-frame) height)
      (set-frame-position (selected-frame) x y))  )
  )
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-horizontally)

(defun local-ediff-before-setup-hook ()
  (setq local-ediff-saved-frame-configuration (current-frame-configuration))
  (setq local-ediff-saved-window-configuration (current-window-configuration))
  (local-ediff-frame-maximize)
  (if git-mergetool-emacsclient-ediff-active
      (raise-frame)))

(defun local-ediff-quit-hook ()
  (set-frame-configuration local-ediff-saved-frame-configuration)
  (set-window-configuration local-ediff-saved-window-configuration))

(defun local-ediff-suspend-hook ()
  (set-frame-configuration local-ediff-saved-frame-configuration)
  (set-window-configuration local-ediff-saved-window-configuration))

(add-hook 'ediff-before-setup-hook 'local-ediff-before-setup-hook)
(add-hook 'ediff-quit-hook 'local-ediff-quit-hook 'append)
(add-hook 'ediff-suspend-hook 'local-ediff-suspend-hook 'append)

;; Useful for ediff merge from emacsclient.
(defun git-mergetool-emacsclient-ediff (local remote base merged)
  (setq git-mergetool-emacsclient-ediff-active t)
  (if (file-readable-p base)
      (ediff-merge-files-with-ancestor local remote base nil merged)
    (ediff-merge-files local remote nil merged))
  (recursive-edit))

(defun git-mergetool-emacsclient-ediff-after-quit-hook ()
  (exit-recursive-edit))

(add-hook 'ediff-after-quit-hooks 'git-mergetool-emacsclient-ediff-after-quit-hook 'append)
(provide 'joseph-vc)
</span><span class="org-block-end-line"> #+end_src
</span>
</pre>
  </body>
</html>
